Tekla Open API Reference for Tekla Structures 2025
Operation.IFCExportViewTypeEnum Enumeration
 View configuration type for IFC export
 Namespace: Tekla.Structures.Model.Operations
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum IFCExportViewTypeEnum
Public Enumeration IFCExportViewTypeEnum
See Also
Reference
Tekla.Structures.Model.Operations Namespace